# MERGE ALL CAPTURED DATA

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
cnx = create_engine('postgresql://username:password@ip:port/database')

In [4]:
# BRING IN ALL BLOCK AND CLOSEST STATIONS ID
pd.read_sql_query('''SELECT * FROM karl3 limit 5;''',cnx)

,id,index,assemdist,atomicid,borough,censusbloc,censustrac,commdist,electdist,schooldist,...,station2_index,station3_distance,station3_index,stationid,year,total_months,as_start_count,as_end_count,as_start_avg,as_end_avg
0,1,0,62,5024401430,5,4023,24400,503,2,31,...,75,0.284858,541,None,None,None,None,None,None,None
1,2,1,62,5024401439,5,4030,24400,503,4,31,...,75,0.279811,541,None,None,None,None,None,None,None
2,3,2,62,5024402223,5,2002,24400,503,5,31,...,75,0.272801,541,None,None,None,None,None,None,None
3,4,3,62,5024401441,5,4031,24400,503,4,31,...,75,0.278737,541,None,None,None,None,None,None,None
4,5,4,62,5024401440,5,4015,24400,503,2,31,...,75,0.289309,541,None,None,None,None,None,None,None

In [6]:
# INFO ON CLOSEST STATIONS 1, 2, & 3
pd.read_sql_query('''SELECT * FROM firtclosest limit 5;''',cnx)

,id,stationid1,year1,total_months1,as_start_count1,as_end_count1,as_start_avg1,as_end_avg1
0,0,489,2013,41,96274,96591,2348.146341,2355.878049
1,1,3317,2016,4,1839,1838,459.750000,459.500000
2,2,3306,2016,4,2870,2705,717.500000,676.250000
3,3,458,2013,41,145438,147743,3547.268293,3603.487805
4,4,478,2013,41,121505,125955,2963.536585,3072.073171

In [7]:
pd.read_sql_query('''SELECT * FROM secondclosest limit 5;''',cnx)

,id,stationid2,year2,total_months2,as_start_count2,as_end_count2,as_start_avg2,as_end_avg2
0,0,489,2013,41,96274,96591,2348.146341,2355.878049
1,1,3317,2016,4,1839,1838,459.750000,459.500000
2,2,3306,2016,4,2870,2705,717.500000,676.250000
3,3,458,2013,41,145438,147743,3547.268293,3603.487805
4,4,478,2013,41,121505,125955,2963.536585,3072.073171

In [8]:
pd.read_sql_query('''SELECT * FROM thirdclosest limit 5;''',cnx)

,id,stationid3,year3,total_months3,as_start_count3,as_end_count3,as_start_avg3,as_end_avg3
0,0,489,2013,41,96274,96591,2348.146341,2355.878049
1,1,3317,2016,4,1839,1838,459.750000,459.500000
2,2,3306,2016,4,2870,2705,717.500000,676.250000
3,3,458,2013,41,145438,147743,3547.268293,3603.487805
4,4,478,2013,41,121505,125955,2963.536585,3072.073171

In [15]:
# JOINS
final = pd.read_sql_query('''SELECT * FROM karl3 as k 
                    JOIN firtclosest AS f ON k.station1_index = f.id 
                    JOIN secondclosest AS s ON k.station2_index = s.id
                    JOIN thirdclosest AS t ON k.station3_index = t.id''',cnx)

In [22]:
final.shape

(65849, 50)

In [16]:
final.columns

Index([u'id', u'index', u'assemdist', u'atomicid', u'borough', u'censusbloc',
       u'censustrac', u'commdist', u'electdist', u'schooldist', u'shape_area',
       u'shape_leng', u'water_flag', u'station1_distance', u'station1_index',
       u'station2_distance', u'station2_index', u'station3_distance',
       u'station3_index', u'stationid', u'year', u'total_months',
       u'as_start_count', u'as_end_count', u'as_start_avg', u'as_end_avg',
       u'id', u'stationid1', u'year1', u'total_months1', u'as_start_count1',
       u'as_end_count1', u'as_start_avg1', u'as_end_avg1', u'id',
       u'stationid2', u'year2', u'total_months2', u'as_start_count2',
       u'as_end_count2', u'as_start_avg2', u'as_end_avg2', u'id',
       u'stationid3', u'year3', u'total_months3', u'as_start_count3',
       u'as_end_count3', u'as_start_avg3', u'as_end_avg3'],
      dtype='object')

In [17]:
final.count()

id                   65849
index                65849
assemdist            65849
atomicid             65849
borough              65849
censusbloc           65849
censustrac           65849
commdist             65849
electdist            65849
schooldist           65849
shape_area           65849
shape_leng           65849
water_flag           65849
station1_distance    65849
station1_index       65849
station2_distance    65849
station2_index       65849
station3_distance    65849
station3_index       65849
stationid              698
year                   698
total_months           698
as_start_count         698
as_end_count           698
as_start_avg           698
as_end_avg             698
id                   65849
stationid1           65849
year1                65849
total_months1        65849
as_start_count1      65849
as_end_count1        65849
as_start_avg1        65849
as_end_avg1          65849
id                   65849
stationid2           65849
year2                65849
total_months2        65849
as_start_count2      65849
as_end_count2        65849
as_start_avg2        65849
as_end_avg2          65849
id                   65849
stationid3           65849
year3                65849
total_months3        65849
as_start_count3      65849
as_end_count3        65849
as_start_avg3        65849
as_end_avg3          65849
dtype: int64

In [20]:
import csv
final.to_csv('Second_try.csv')

In [25]:
# ADDED ZONES
finalwzones = pd.read_sql_query('''SELECT * FROM karl3 as k 
                    JOIN firtclosest AS f ON k.station1_index = f.id 
                    JOIN secondclosest AS s ON k.station2_index = s.id
                    JOIN thirdclosest AS t ON k.station3_index = t.id
                    JOIN zones AS z ON k.atomicid = z.atomicid''',cnx)

In [26]:
finalwzones.shape

(65849, 53)

In [27]:
finalwzones.to_csv('Third_try.csv')

In [30]:
# ADJUSTED STATIONS
adjustedfinalwzones = pd.read_sql_query('''SELECT * FROM karl3fix as k 
                    JOIN firtclosest AS f ON k.station1_index = f.id 
                    JOIN secondclosest AS s ON k.station2_index = s.id
                    JOIN thirdclosest AS t ON k.station3_index = t.id
                    JOIN zones AS z ON k.atomicid = z.atomicid''',cnx)

In [32]:
adjustedfinalwzones.shape

(65849, 53)

In [31]:
adjustedfinalwzones.to_csv('Fourth_try.csv')

In [34]:
# ADDED ZIPCODE INFO
adjustedfinalwzoneswzips = pd.read_sql_query('''SELECT * FROM karl3fix as k 
                    JOIN firtclosest AS f ON k.station1_index = f.id 
                    JOIN secondclosest AS s ON k.station2_index = s.id
                    JOIN thirdclosest AS t ON k.station3_index = t.id
                    JOIN zones AS z ON k.atomicid = z.atomicid
                    JOIN zipsloc AS zip ON k.atomicid = zip.atomicid''',cnx)

In [35]:
adjustedfinalwzoneswzips.shape

(65849, 62)

In [36]:
adjustedfinalwzoneswzips.to_csv('Fifth_try.csv')

In [9]:
# ADDED MTA INFO
blocsstationszoneszipsmta = pd.read_sql_query('''SELECT * FROM karl3fix as k 
                    JOIN firtclosest AS f ON k.station1_index = f.id 
                    JOIN secondclosest AS s ON k.station2_index = s.id
                    JOIN thirdclosest AS t ON k.station3_index = t.id
                    JOIN zones AS z ON k.atomicid = z.atomicid
                    JOIN zipsloc AS zip ON k.atomicid = zip.atomicid
                    LEFT JOIN mta2 AS m ON k.atomicid = m.atomicid''',cnx)

In [10]:
blocsstationszoneszipsmta.shape

(66135, 66)

In [11]:
blocsstationszoneszipsmta.to_csv('Sixth_try.csv')

In [15]:
# MORE COMPLETE JOIN
blocs_station_stations_zones_zips_mta_mtas = pd.read_sql_query('''SELECT * FROM karl3fix as k 
                    JOIN firtclosest AS f ON k.station1_index = f.id 
                    JOIN secondclosest AS s ON k.station2_index = s.id
                    JOIN thirdclosest AS t ON k.station3_index = t.id
                    JOIN zones AS z ON k.atomicid = z.atomicid
                    JOIN zipsloc AS zip ON k.atomicid = zip.atomicid
                    JOIN mtadistances AS d ON k.atomicid = d.atomicid 
                    LEFT JOIN mta2 AS m ON k.atomicid = m.atomicid''',cnx)

In [16]:
blocs_station_stations_zones_zips_mta_mtas.shape

(66135, 71)

In [17]:
blocs_station_stations_zones_zips_mta_mtas.to_csv("Seventh_try.csv")

## CITIBIKE TRIP DATA

In [1]:
# TRIP DATA
monthly_trips = pd.read_sql_query('''SELECT * FROM trips; ''', cnx)

In [4]:
monthly_trips.head()

,id,tripduration,starttime,stoptime,startstationid,startstationname,startstationlatitude,startstationlongitude,endstationid,endstationname,endstationlatitude,endstationlongitude,bikeid,usertype,birthyear,gender
0,3551565,518,2013-10-20 13:23:19,2013-10-20 13:31:57,294,Washington Square E,40.730494,-73.995721,168,W 18 St & 6 Ave,40.739713,-73.994564,15987,Subscriber,1979,1
1,3551566,907,2013-10-20 13:23:19,2013-10-20 13:38:26,525,W 34 St & 11 Ave,40.755942,-74.002116,358,Christopher St & Greenwich St,40.732916,-74.007114,15704,Subscriber,1969,1
2,3551567,465,2013-10-20 13:23:20,2013-10-20 13:31:05,483,E 12 St & 3 Ave,40.732233,-73.988900,383,Greenwich Ave & Charles St,40.735238,-74.000271,18708,Subscriber,1986,1
3,3551568,395,2013-10-20 13:23:20,2013-10-20 13:29:55,339,Avenue D & E 12 St,40.725806,-73.974225,339,Avenue D & E 12 St,40.725806,-73.974225,17005,Subscriber,1983,2
4,3551569,1472,2013-10-20 13:23:23,2013-10-20 13:47:55,304,Broadway & Battery Pl,40.704633,-74.013617,212,W 16 St & The High Line,40.743349,-74.006818,19283,Subscriber,1977,2

In [5]:
import datetime
import pandas as pd
monthly_trips['datetime'] = pd.to_datetime(monthly_trips['starttime'], format = '%Y/%m/%d %H:%M:%S')
monthly_trips['year'] = monthly_trips.datetime.dt.year
monthly_trips['month'] = monthly_trips.datetime.dt.month

In [20]:
monthly_trips.tail()

,id,tripduration,starttime,stoptime,startstationid,startstationname,startstationlatitude,startstationlongitude,endstationid,endstationname,endstationlatitude,endstationlongitude,bikeid,usertype,birthyear,gender,datetime,year,month
0,3551565,518,2013-10-20 13:23:19,2013-10-20 13:31:57,294,Washington Square E,40.730494,-73.995721,168,W 18 St & 6 Ave,40.739713,-73.994564,15987,Subscriber,1979,1,2013-10-20 13:23:19,2013,10
1,3551566,907,2013-10-20 13:23:19,2013-10-20 13:38:26,525,W 34 St & 11 Ave,40.755942,-74.002116,358,Christopher St & Greenwich St,40.732916,-74.007114,15704,Subscriber,1969,1,2013-10-20 13:23:19,2013,10
2,3551567,465,2013-10-20 13:23:20,2013-10-20 13:31:05,483,E 12 St & 3 Ave,40.732233,-73.988900,383,Greenwich Ave & Charles St,40.735238,-74.000271,18708,Subscriber,1986,1,2013-10-20 13:23:20,2013,10
3,3551568,395,2013-10-20 13:23:20,2013-10-20 13:29:55,339,Avenue D & E 12 St,40.725806,-73.974225,339,Avenue D & E 12 St,40.725806,-73.974225,17005,Subscriber,1983,2,2013-10-20 13:23:20,2013,10
4,3551569,1472,2013-10-20 13:23:23,2013-10-20 13:47:55,304,Broadway & Battery Pl,40.704633,-74.013617,212,W 16 St & The High Line,40.743349,-74.006818,19283,Subscriber,1977,2,2013-10-20 13:23:23,2013,10